# 1. На входе пользователь вводит несколько чисел через пробел. На выходе - количество чисел, которые не повторяются.
set1 = input('Введите числа,разделяя пробелом: ').split()
set1_int = int(set1)
count = 0
print(set1_int)
for i in set1_int:
    if i == i:
   print("Числа повторяются")
else:
    count += 1
print(count)
# 2. На входе пользователь дважды вводит несколько чисел через пробел. На выходе - количество чисел, которые содержатся одновременно в первом и втором множестве.

set2 = set(input("Введите числа,разделяя пробелом: ").split())
set3 = set(input("Введите числа,разделяя пробелом: ").split())
count2 = 0
print(set2)
print(set3)
all_sets = set2.union(set3)
print(all_sets)
print(len(all_sets))

# 3. На входе пользователь дважды вводит несколько чисел через пробел. На выходе - вывести совпадающие числа в порядке возрастания
# 10 20 1 2 3 4 7 5 --> 1 2 3 4 5 7 10 20
set4 = set(input("Введите числа,разделяя пробелом: ").split())
set5 = set(input("Введите числа,разделяя пробелом: ").split())
# 4. (Дополнительно) На входе пользователь вводит несколько чисел через пробел. На выходе - вывести все числа в столбик, напротив каждого написать слово "Встречалось" или "Не встречалось", если число уже было в последовательности.


# 5. (дополнительно) Есть текст. Пользователь ничего не вводит. На выходе указать, сколько различных слов было в тексте (знаки пунктуации не учитывать, программа не должна быть чувствительна к регистру).

